# Rebar Hook Type Hook Angle Property

Source: https://www.revitapidocs.com/2026/85af7224-b751-4c40-a5d5-5b4dc757f742.htm

---

| Rebar Hook Type Hook Angle Property |
| --- |

The hook angle, measured in radians. Must be greater than 0\.0174532925 (1 degree) and no more than PI (180 degree).
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double HookAngle { get; set; }
```

```
Public Property HookAngle As Double
	Get
	Set
```

```
public:
property double HookAngle {
	double get ();
	void set (double value);
}
```

```
member HookAngle : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for hookAngle is not a number |
| ArgumentOutOfRangeException | When setting this property: hookAngle must be greater than 0\.0174532925 (1 degree) and no more than PI (180 degree). |

See Also

#### Reference

RebarHookType Class Autodesk.Revit.DB.Structure Namespace